#pragma once

#include "glm/glm.hpp"
#include "graphics_data.h"

namespace DigitalSculpt
{
    class MeshStats : public GraphicsData
    {
    public:
        /******************************************************************************************************************
         * Desc:
         * Method:    MeshStats
         * Returns:
         ****************************************************************************************************************/
        MeshStats();

        /******************************************************************************************************************
         * Desc:
         * Method:    ~MeshStats
         * Returns:
         ****************************************************************************************************************/
        ~MeshStats();

        /******************************************************************************************************************
         * Desc:  Collect All Relevant Stats in a mesh linearly.
         * Method:    collectStats
         * Returns:   void
         ****************************************************************************************************************/
        void collectStats();

        /// <summary>
        /// 存储了模型的最大的坐标xyz值的vec3
        /// </summary>
        glm::vec3 limMax;

        /// <summary>
        /// 存储了模型的最小的坐标xyz值的vec3
        /// </summary>
        glm::vec3 limMin;

        /// <summary>
        /// 模型的每一个顶点的xyz值之和，各自除以顶点的个数，得到xyz坐标值的平均值，存储到此变量
        /// </summary>
        glm::vec3 center;

    };
}